_Rarzrabotki/Rarus/USO2/Documents/СМ_СводнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_СводнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГлаваССРС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазбивкаПоГодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Год</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыЗначенийЛимитированныхЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыЗначенийЛимитированныхЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коэффициент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индекс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_СводнаяСмета/Forms/ФормаПодбораЛимитированныхЗатрат/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	ПараметрыФормы = ЭтаФорма.Параметры;
	Если ЭтаФорма.Параметры.Свойство("СписокЛЗ") Тогда
		СписокЛЗ = Параметры.СписокЛЗ;
		ТабЛЗ 	 = СМ_СметныйСоставВызовСервера.ПолучитьЛимЗатратыОС(СписокЛЗ, Параметры.МетодикаРасчета);
        ЭтаФорма.ТабЛимЗатрат.Загрузить(ТабЛЗ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивЛЗ = Новый Массив;
	
	Для Каждого ТекСтрока Из ЭтаФорма.ТабЛимЗатрат Цикл
		Если ТекСтрока.Расчет Тогда
			МассивЛЗ.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	ОповеститьОВыборе(МассивЛЗ); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеЛимЗатратыПриИзменении(Элемент)
	
	ЗаполнитьЗначениеВСтрокеТЧ(Элемент.Имя);
//	ТекДанные 								= Элементы.ТабЛимЗатрат.ТекущиеДанные;
//	ТекДанные.БазисноеЗначениеЛимЗатраты 	= ЭтаФорма.ЗначениеЛимЗатраты;
//	ЭтаФорма.БазисноеЗначениеЛимЗатраты		= ЭтаФорма.ЗначениеЛимЗатраты;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаЛимЗатратыПриИзменении(Элемент)
	
	ЗаполнитьЗначениеВСтрокеТЧ(Элемент.Имя);
	
	ТекущиеДанные = Элементы.ТабЛимЗатрат.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.ЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаЛимЗатраты = ТекФормула;
		Попытка
			Формула = "ТекЗначение = " + ТекущиеДанные.ФормулаЛимЗатраты + "; ТекущиеДанные.ЗначениеЛимЗатраты = ТекЗначение;";
			Выполнить(Формула);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, значение затраты не изменено'"));
		КонецПопытки;
	КонецЕсли;
	ЭтаФорма.ЗначениеЛимЗатраты = ТекЗначение;  
	ОбновитьРасчет();
КонецПроцедуры

&НаКлиенте
Процедура БазисноеЗначениеЛимЗатратыПриИзменении(Элемент)
	
	ЗаполнитьЗначениеВСтрокеТЧ(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаБазисногоЗначениеЛимЗатратыПриИзменении(Элемент)
	
	
	ЗаполнитьЗначениеВСтрокеТЧ(Элемент.Имя);
	
	ТекущиеДанные = Элементы.ТабЛимЗатрат.ТекущиеДанные;
	ТекЗначение = ТекущиеДанные.БазисноеЗначениеЛимЗатраты;
	ТекФормула = СокрЛП(ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты);
	Если ТекФормула <> "" Тогда
		ТекФормула = СтрЗаменить(ТекФормула,",",".");
		ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты = ТекФормула;
		Попытка
			Формула = "ТекЗначение = " + ТекущиеДанные.ФормулаБазисногоЗначениеЛимЗатраты + "; ТекущиеДанные.БазисноеЗначениеЛимЗатраты = ТекЗначение;";
			Выполнить(Формула);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, значение затраты не изменено'"));
		КонецПопытки;
	КонецЕсли;
	ЭтаФорма.БазисноеЗначениеЛимЗатраты = ТекЗначение;
	ОбновитьРасчет();
КонецПроцедуры

&НаКлиенте
Процедура ПримечаниеПриИзменении(Элемент)
	
	ЗаполнитьЗначениеВСтрокеТЧ(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентСметнойЗарплатыПриИзменении(Элемент)
	
	ЗаполнитьЗначениеВСтрокеТЧ(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентТрудоемкостиПриИзменении(Элемент)
	
	ЗаполнитьЗначениеВСтрокеТЧ(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабЛимЗатратПриАктивизацииСтроки(Элемент)
	
	ТекДанные 			= Элементы.ТабЛимЗатрат.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	БазисноеЗначениеЛЗ 	= ТекДанные.БазисноеЗначениеЛимЗатраты;
	
	ЗаполнитьЗначенияЛЗ(ТекДанные.ЛимитированнаяЗатрата,БазисноеЗначениеЛЗ,ТекДанные.РучнойВвод);
	Если ТекДанные.РучнойВвод Тогда
		ЭтаФорма.ЗначениеЛимЗатраты                     = ТекДанные.ЗначениеЛимЗатраты;
		ЭтаФорма.БазисноеЗначениеЛимЗатраты             = ТекДанные.БазисноеЗначениеЛимЗатраты;
		ЭтаФорма.КоэффициентСметнойЗарплаты             = ТекДанные.КоэффициентСметнойЗарплаты;
		ЭтаФорма.КоэффициентТрудоемкости                = ТекДанные.КоэффициентТрудоемкости;
	Иначе
		ТекДанные.ЗначениеЛимЗатраты					= ЭтаФорма.ЗначениеЛимЗатраты;
		ТекДанные.БазисноеЗначениеЛимЗатраты            = ЭтаФорма.БазисноеЗначениеЛимЗатраты;
	КонецЕсли;
	ЭтаФорма.ФормулаЛимЗатраты                      = ТекДанные.ФормулаЛимЗатраты;
	ЭтаФорма.ФормулаБазисногоЗначениеЛимЗатраты     = ТекДанные.ФормулаБазисногоЗначениеЛимЗатраты;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьЗначениеВСтрокеТЧ(ИмяЗначения)
	
	ТекДанные 				= Элементы.ТабЛимЗатрат.ТекущиеДанные;
	ТекДанные[ИмяЗначения] 	= ЭтаФорма[ИмяЗначения];
	ТекДанные.РучнойВвод    = Истина;

	Если ТекДанные.ТипЗначенияЗатраты = ПредопределенноеЗначение("Перечисление.СМ_ТипыЗначенийЛимитированныхЗатрат.Процент") Тогда
		ТекДанные.БазисноеЗначениеЛимЗатраты 	= ЭтаФорма.ЗначениеЛимЗатраты;
		ЭтаФорма.БазисноеЗначениеЛимЗатраты		= ЭтаФорма.ЗначениеЛимЗатраты;
	КонецЕсли;
	ОбновитьРасчет();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРасчет()
	
	ТекДанные 			= Элементы.ТабЛимЗатрат.ТекущиеДанные;
	ТекДанные.Расчет 	= Ложь;
	
	Если ЗначениеЗаполнено(ЭтаФорма.ЗначениеЛимЗатраты)
		ИЛИ ЗначениеЗаполнено(ЭтаФорма.БазисноеЗначениеЛимЗатраты)
		ИЛИ ЗначениеЗаполнено(ЭтаФорма.КоэффициентСметнойЗарплаты)
		ИЛИ ЗначениеЗаполнено(ЭтаФорма.КоэффициентТрудоемкости) Тогда
		ТекДанные.Расчет = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗначенияЛЗ(ТекЛЗ,БазисноеЗначениеЛЗ,РучнойВвод)
	
	ТекОбъект 										= ТекЛЗ.ПолучитьОбъект();
	Если Не РучнойВвод Тогда
		ЭтаФорма.ЗначениеЛимЗатраты                     = ТекОбъект.ЗначениеЗатратыПоУмолчанию;
		ЭтаФорма.КоэффициентСметнойЗарплаты             = ТекОбъект.КоэффициентСметнойЗарплаты;
		ЭтаФорма.КоэффициентТрудоемкости                = ТекОбъект.КоэффициентТрудоемкости;
	КонецЕсли;

	Если ТекОбъект.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Процент Тогда
		ЭтаФорма.БазисноеЗначениеЛимЗатраты	= ТекОбъект.ЗначениеЗатратыПоУмолчанию;
	Иначе
		ЭтаФорма.БазисноеЗначениеЛимЗатраты = БазисноеЗначениеЛЗ;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти
